package Task6;

/**
 * Реализовать самостоятельно операцию взятия остатка (не
 * использовать оператор %)
 */

public class MainRun {
    public static void main(String[] args) {
        int a = 10;
        int b = 3;
        int c = a-((a / b)*b);
        System.out.println(c);

    }
}
